app/controllers/posts_controller.rb

INSERT INTO "posts" ("author", "post") VALUES ($1, $2) RETURNING "id"  [["author", "author3"], ["post", "post3"]]
---
  def create
  @post = Post.new(post_params)
  @post.save