app/controllers/users_controller.rb

  def sign_up!
    user = User.new(
      username: params[:username],
      password_digest: BCrypt::Password.create(params[:password])
    )
---
INSERT INTO "users" ("username", "password_digest") VALUES ($1, $2) RETURNING "id"  [["username", "M00staff"], ["password_digest", "$2a$10$05WJKNqfLzgY7tG/9ylIaOBGhhF2t0JKxiW00tV8VVM53bP/cj9UG"]]

  def sign_in!
    @user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "M00staff"]]